Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/index.html.txt.tmx
Source language: en
Languages: ga

source: Case study 1: Calculating your pension under EU social security agreements
ga: Cás-staidéar 1: Do phinsean a ríomh faoi chomhaontuithe slándála sóisialaí an AE

source: Case study showing how to calculate your pension entitlement under EU social security agreements
ga: Cás-staidéar a léiríonn conas do theidlíocht phinsin a ríomh faoi chomhaontuithe slándála sóisialaí an AE

source: Case study 2: Calculating your pension under bilateral social security agreements
ga: Cás-staidéar 2: Do phinsean a ríomh faoi chomhaontuithe déthaobhacha slándála sóisialaí

source: Case study showing how your entitlement to State Pension (Contributory) is calculated under bilateral social security agreements
ga: Léiríonn an cás-staidéar seo conas a dhéantar do theidlíocht ar Phinsean Stáit (Ranníocach) a ríomh faoi chomhaontuithe déthaobhacha slándála sóisialaí

source: Case study 1: Family Income Supplement (FIS)
ga: Cás-Staidéar 1: Forlíonadh Ioncaim Teaghlaigh (FIT)

source: This case study examines how a lone parent is assessed for Family Income Supplement
ga: Déanann an cás-staidéar seo scagadh ar an gcaoi a dhéantar measúnú ar thuismitheoir aonair i leith Forlíonadh Ioncaim Teaghlaigh

source: Case study 2: Family Income Supplement (FIS)
ga: Cás-staidéar 2: Forlíonadh Ioncaim Teaghlaigh (FIT)

source: This case study examines how a family on low income is assessed for Family Income Supplement
ga: Déanann an cás-staidéar seo scagadh ar an gcaoi a dhéantar measúnú ar theaghlach ar ioncam íseal i leith Forlíonadh Ioncaim Teaghlaigh

source: Case Study 1: How income from work affects Jobseeker's Allowance
ga: Cás-staidéar 1: Conas a bhíonn tionchar ag ioncam ón obair ar Liúntas do Lucht Cuardaigh Fostaíochta

source: Income from work affects your Jobseeker's Allowance payment
ga: Bíonn tionchar ag ioncam ó obair ar d’íocaíocht Liúntais do Lucht Cuardaigh Fostaíochta

source: This case study shows how work can affect this payment
ga: Léiríonn an cás-staidéar seo conas a d’fhéadfadh tionchar a bheith ag obair ar an íocaíocht sin

source: Case study 2: How income from employment affects your Jobseeker's Allowance
ga: Cás-staidéar 2: Conas a bhíonn tionchar ag ioncam ó fhostaíocht in Éirinn ar an Liúntas do Lucht Cuardaigh Fostaíochta

source: A case study showing how income from employment affects your Jobseeker's Allowance
ga: Cás-staidéar maidir le conas atá tionchar ag ioncam ó fhostaíocht ar do Liúntas do Lucht Cuardaigh Fostaíochta

source: Case studies: Choosing between the student grant and Back to Education Allowance
ga: Samplaí iad seo de dhá iarratas éagsúla i gcomhair saoire force majeure agus nár ceadaíodh ach ceann amháin acu

source: Three case studies exploring the choices available to people getting Jobseeker’s Allowance, One-Parent Family Payment and Disability Allowance
ga: Diúltaíodh don dara iarratas toisc nach raibh aon teidlíocht ann faoin Acht um Shaoire do Thuismitheoirí 1998

source: Case study: Calculating Rent Supplement
ga: Cás- Staidéar ar shaoire cúramóra agus saoire bhliantúil

source: This is an example showing how Rent Supplement is calculated
ga: Má tá tú as láthair ar shaoire cúramóra ar feadh cuid den bhliain, ní chuirtear cosc ort saoire bhliantúil a thógáil tar éis filleadh ar obair

source: Case study: Calculating annual leave
ga: Cás-Staidéar ar íocaíocht iomarcaíochta agus obair ghearr-ama

source: Working out your statutory leave entitlement can be quite complex, if you start work in the middle of a leave year
ga: Rinne fostaí iomarcach nuair bhí sé ag obair uaireanta laghdaithe ar feadh níos mó ná bliain amháin

source: This case study shows how one employee's leave was calculated
ga: Léiríonn an cás staidéar seo conas a bheidh luach íocaíochta iomarcaíochta ag brath ar chúinsí áirithe

source: Case study: Calculating deferrals of Local Property Tax (LPT)
ga: Cás-Staidéar ar saoire atruach

source: Case study showing how to calculate whether you qualify for a deferral of Local Property Tax
ga: Sampla a léiríonn conas atá teidlíocht saoire atruach ag brath ar dhiscréid an fhostóra nó ar nósanna agus ar chleachtais laistigh den ionad oibre

source: Case study: Calculating redundancy payment
ga: Cás-Staidéar ar shaoire mháithreachais agus filleadh ar an obair

source: Case study on how the redundancy payment for a particular employee was calculated
ga: Léiríonn an cás-staidéar seo gur gá duit nósanna imeachta ceart a leanúint nuair a fhilleann tú ar obair tar éis saoire mháithreachais

source: Case study: Calculating your income tax
ga: Cás-Staidéar ar theidlíocht saoire poiblí

source: Tax on income you earn from employment is deducted directly from your salary (pay)
ga: Tá oibrithe páirtaimseartha i dteideal saoire poiblí fiú mura mbíonn siad ag obair ar an lá saoire poiblí

source: A case study on how this tax is calculated
ga: Déanann an cás-staidéir cur síos ar conas atá an íocaíocht oibrí páirtaimseartha le haghaidh saoire phoiblí ríofa

source: Case study: Carer's leave and annual leave
ga: Cás-Staidéar: Cabhrú le costais scoile do theaghlach

source: Being absent on carer's leave for part of a year does not prevent an employee from taking annual leave later on in the year after returning to work
ga: Liúntas agus deontais chun cabhrú lena costais scoile

source: Case study: Claiming constructive dismissal
ga: Cás-Staidéar: éileamh i ndáil le dífhostú inchiallaithe

source: An employee who left her employment claimed constructive dismissal
ga: D'fhág fostaí a gcuid oibre agus rinne sí éileamh ar dhífhostú inchiallaithe

source: She has to prove that her resignation was justified in order to win her case for unfair dismissal
ga: Ní mór dí a chruthú go seastar a n-éirí as chun bua le haghaidh a gcás dífhostú éagórach a fháil

source: Case study: Compassionate leave
ga: Cás-Staidéar: íocaíocht iomarcaíochta a mheas

source: Example of how entitlement to compassionate leave is generally at employer's discretion or custom and practice in the workplace
ga: Cás-stáidéar a léiríonn conas atá íocaíocht iomarcaíochta le haghaidh fostaí ar leith ríofa

source: Explains how the spouse of a Critical Skills Employment Permit can apply for a specific employment permit
ga: Nuair a ríomhtar ráta san uair le haghaidh íosphá náisiúnta, ní áirítear íocaíochtaí áirithe

source: Case study: Help with school costs for a family
ga: Cás-Staidéar: saoire bhliantúil a mheas

source: Allowances and grants available to help with the costs of going to school
ga: Léiríonn an cás-stáidéar seo conas a mheas saoire aon fhostaí amháin

source: Case study: Jobseeker’s Benefit and systematic short time work
ga: Cás-staidéar: Ag obair agus ag éileamh Pinsin Stáit (Neamh-Ranníocach)

source: This is a case study showing you how to calculate the length of time a systematic short time worker can get Jobseeker's Benefit
ga: Scrúdaítear sa chás-staidéar seo an tionchar a bhíonn ar thuillimh ó fhostaíocht ar do Phinsean Stáit (Neamh-Ranníocach)

source: This case study shows the need to follow correct procedures when returning to work after maternity leave
ga: Sampla a léiríonn conas is féidir le duine atá dífhostaithe toisc gníomhaíocht cheardchumainn éileamh a dhéanamh ar dhífhostú éagórach

source: Case study: Maximising a couple's income from jobseeker's payments
ga: Cás-staidéar: Cead Fostaíochta do Chleithiúnaí/Pháirtnéir/Chéile

source: This is a case study showing you how to assess a couple’s entitlement to jobseeker's payments in order to maximise their income
ga: Mínítear conas is féidir le céile sealbhóra Ceada Fostiaíochta Scileanna Criticiúla iarratas a dhéanamh ar Chead Fostaíochta do Chleithiúnaí/Pháirtnéir/Chéile

source: Case study: Minimum wage
ga: Cás-staidéar: Do cháin ioncaim a ríomh

source: When calculating the hourly rate for the national minimum wage, certain payments are not included
ga: Déantar cáin ar ioncam a thuilltear ó fhostaíocht a bhaint go díreach as do thuarastal (pá)

source: This case study shows how an employer's incorrect calculation meant the employee was being paid less than the national minimum wage
ga: Cás-staidéar maidir le conas a ríomhtar an cháin seo

source: Case study: Public holiday entitlement
ga: Cás-staidéar: Forlíonadh Cíosa a Ríomh

source: This case study shows how a part-time worker's payment for a public holiday is calculated
ga: Seo sampla a thaispeánann conas Forlíonadh Cíosa a ríomh in 2014

source: Case study: Redundancy payment and short-time working
ga: Cás-staidéar: Gearradh cánach ar Shochar Máithreachais

source: An employee who had been working reduced hours for over a year was made redundant
ga: Cás-staidéar a léiríonn conas a ghearrtar cáin ar Shochar Máithreachais

source: Case study: Taking parental leave
ga: Cás-staidéar: Iarchur Cáin Mhaoine Áitiúil (CMÁ) a Dheimhniú

source: This example shows the different parental leave entitlements of a particular couple with a small child
ga: Cás-staidéar a léiríonn conas a dheimhniú an gcáilítear nó nach gcáilítear thú d’iarchur Cáin Mhaoine Áitiúil

source: Case study: Taxation of Maternity Benefit
ga: Cás-staidéar: Ioncam lánúine ó íocaíochtaí cuardaitheora poist a uasmhéadú

source: A case study showing how Maternity Benefit is taxed
ga: Is cás-staidéar é seo ina léirítear duit an chaoi chun teidlíocht lánúine ar íocaíochtaí cuardaitheora poist a mheasúnú chun a gcuid ioncaim a uasmhéadú

source: Case study: Trade union membership
ga: Cás-staidéar: Uaireanta oibre do dhaoine óga

source: Example showing how someone dismissed for trade union activity can claim unfair dismissal
ga: Sampla d'uaireanta oibre atá ceadaithe do chailín 14 bliana d'aois

source: Case study: Working and claiming a State Pension (Non-Contributory)
ga: Cás-staidéar: saoire thuismitheoirí a thógáil

source: This case study examines how the earnings from employment will affect your State Pension (Non-Contributory)
ga: Léiríonn an sampla seo na teidlíochtaí difriúla de lánúin le leanbh óg ar leith

source: Case study: Young people's working hours Example of the working hours permitted for a girl aged 14
ga: Trí chás-staidéar ina ndéantar scagadh ar na roghanna atá ar fáil do dhaoine a fhaigheann Liúntas do Lucht Cuardaigh Fostaíochta, Íocaíocht do Theaghlach Aon-Tuismitheora agus Liúntas Míchumais

source: Example of 2 different requests for force majeure leave, one of which was granted
ga: Sochar Cuardaitheora Poist agus obair ghearr-ama chórasach

source: The second request was refused as there was no entitlement under the Parental Leave Act 1998
ga: Is staidéar cáis é seo le taispeáint duit conas an méid ama a fhéadfaidh oibrí gearr-ama córasach Sochar Cuardaitheora Poist a fháil. Teanga

source: Most Read in "Reference"
ga: Ábhar is mó éilimh i "Reference"

source: At what age can I?
ga: Cén aois is féidir liom?

source: Checklist when applying for Jobseeker's Allowance
ga: Seicliosta nuair atá iarratas á dhéanamh ar Liúntas Cuardaitheora Poist
